---
kind: other
id: Methods.T:Autodesk.Revit.DB.Viewport
source: html/7744ebd3-e87e-5a60-e5b3-fc97fb2569af.htm
---
# Viewport Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.